post/quan-ly-cau-hinh-emacs-voi-guix/index.html
<!DOCTYPE html>
<html lang="vi-vn">
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <title> Quản lý cấu hình Emacs với Guix | MẤY KHI MẤY KHỈ</title>
  
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="robots" content="all,follow">
  <meta name="googlebot" content="index,follow,snippet,archive">
  <meta property="og:title" content="Quản lý cấu hình Emacs với Guix" />
<meta property="og:description" content="Lý do  Emacs hay Vim thì tính cá nhân hoá rất cao. Để cá nhân hoá cao thì mình phải có bộ config của riêng mình. Ngoài các config về cài đặt thì mình có thể sửa đổi (patch) các package cho vừa ý mình. Vì thế mà mình sẽ phải maintain các bản sửa đổi.
  Các ý tưởng  Git luôn .emacs.d/elpa  Tức mình có thể dùng package." />
<meta property="og:type" content="article" />
<meta property="og:url" content="/post/quan-ly-cau-hinh-emacs-voi-guix/" />
<meta property="article:published_time" content="2023-02-12T02:51:36+00:00" />
<meta property="article:modified_time" content="2023-02-12T02:51:36+00:00" />

  <meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Quản lý cấu hình Emacs với Guix"/>
<meta name="twitter:description" content="Lý do  Emacs hay Vim thì tính cá nhân hoá rất cao. Để cá nhân hoá cao thì mình phải có bộ config của riêng mình. Ngoài các config về cài đặt thì mình có thể sửa đổi (patch) các package cho vừa ý mình. Vì thế mà mình sẽ phải maintain các bản sửa đổi.
  Các ý tưởng  Git luôn .emacs.d/elpa  Tức mình có thể dùng package."/>

  
  
    
  
  
  <link rel="stylesheet" href="/css/style-light.css">
  
  
  
    <!--[if lt IE 9]>
    <![endif]-->
  

  
<link rel="icon" type="image/png" href="/images/favicon.ico" />

  
  
</head>

<body class="max-width mx-auto px3 ltr">
  <div class="content index py4">

    <header id="header">
  <a href="/">
  
    <div id="logo" style="background-image: url(https://avatars.githubusercontent.com/u/9713793?s=64)"></div>
  
  <div id="title">
    <h1>MẤY KHI MẤY KHỈ</h1>
  </div>
  </a>
  <div id="nav">
    <ul>
      <li class="icon">
        <a href="#"><i class="fas fa-bars fa-2x"></i></a>
      </li>
      
        <li><a href="/post/intro">Intro</a></li>
      
        <li><a href="/post">Writings</a></li>
      
    </ul>
  </div>
</header>



    
<article class="post" itemscope itemtype="http://schema.org/BlogPosting">

  <div class="content" itemprop="articleBody">
  
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Lý do
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Emacs hay Vim thì tính cá nhân hoá rất cao. Để cá nhân hoá cao thì mình phải có bộ config của riêng mình.
Ngoài các config về cài đặt thì mình có thể sửa đổi (patch) các package cho vừa ý mình. Vì thế mà mình sẽ phải maintain các bản sửa đổi.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Các ý tưởng
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Git luôn .emacs.d/elpa
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>Tức mình có thể dùng package.el để cài đặt trưóc, sau đó dùng git để quản lý toàn bộ <code>~/.emacs.d/elpa</code>
như doom-emacs</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Sử dụng straight
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>Ý tưởng của <a href="https://github.com/radian-software/straight.el">straight.el</a> là khai báo trực tiếp link của source code và kéo về build. Không rõ là có thể patch mã luôn không</p>
<ul>
<li>
<p>Ưu điểm: Reproducible builds</p>
</li>
<li>
<p>Nhược điểm: lúc kéo về toàn bộ lâu hơn so với dùng built-in package.el</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Sử dụng borg như tác giả magit
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Ý tưởng của <a href="https://emacsmirror.net/manual/borg/">borg</a> là dùng dạng submodule, sau mình patch thì mình đẩy lên repo của mình.
Nhược điểm chắc sẽ là quản lý nhiều repo nếu mình patch nhiều packages.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Sử dụng GNU Guix
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Khi biết đến Guix, mình đã nghĩ ngay việc dùng Guix để quản lý package.
Vì nó reproducible như straight, mà lại quản lý pacthes tập trung bằng các bản vá diff rất rõ ràng.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Lựa chọn Guix
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Sau khi xem xét nhiều ý tưởng/tools. Mình đã chọn <code>Guix</code> để quản lý emacs packages.</p>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Ưu điểm
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ul>
<li>
<p>Các bản vá được lưu trữ tập trung, tường minh (diff file)</p>
</li>
<li>
<p>Tính reproducible cao (100%), mình có thể rollback bất kỳ điểm commit nào (Guix gọi là du hành thời gian)</p>
</li>
<li>
<p>Dễ dàng tính hợp các công cụ/thư viện bên ngoài mà package đó cần. Ví dụ như vterm, telega(Telegram client) hay tree-sitter</p>
</li>
<li>
<p>Xây dựng được kho ELPA cá nhân, mình đã build ở <a href="https://github.com/TxGVNN/giaelpa">TxGVNN/giaelpa</a></p>
</li>
<li>
<p>Config với use-package vẫn làm việc bình thường, không thay đổi. Ngay cả đối với các máy không dùng Guix</p>
</li>
<li>
<p>Còn xuất được Debian package (deb) để cài đặt toàn bộ từ emacs, libs, packages giống hệt</p>
</li>
<li>
<p>Khi mà cloud IDE càng nhiều (Gitpod, Codespace), thì Guix giúp mình tạo ra một môi trường đồng nhất (emacs, libs, packages như nhau)</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Nhược điểm
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<ul>
<li>
<p>Nặng và chậm hơn (không sao)</p>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
Triển khai
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>Để triển khai thì Guix cung cấp khái niệm gọi là <a href=" https://guix.gnu.org/manual/en/html_node/Channels.html">Guix Channel</a>. Nó giống như <code>AUR bên Arch</code> hay kho <code>APT bên Debian</code>.
Nên ta làm theo và tạo ra 1 cái và mình đặt tên là <a href="https://github.com/TxGVNN/guxti">TxGVNN/guxti</a>
Để có thể sử dụng hiện có 3 cách</p>
<ul>
<li>
<p>Sử dụng Guix thì cài đặt channel này, rồi kéo <a href="https://github.com/TxGVNN/dots">TxGVNN/dots</a> về là cài thôi</p>
<ul>
<li>
<p>Cài đặt guix, guix channel này</p>
</li>
<li>
<p><code>guix pull</code> và <code>guix package</code> để cài đặt</p>
</li>
</ul>
<p>Có thể tham khảo <a href="https://github.com/TxGVNN/gitpod">TxGVNN/gitpod</a> nơi mình build ra một bản để dùng trên Gitpod.io</p>
</li>
<li>
<p>Không dùng Guix thì vẫn kéo dotfiles về, Emacs sẽ cài package từ kho <a href="https://github.com/TxGVNN/giaelpa">TxGVNN/giaelpa</a> mình đã xuất ở trên nhưng không đi kèm các thư viện, emacs version được</p>
</li>
<li>
<p>Xuất file deb cho Debian cài
<code>guix pack --format=deb ...</code></p>
</li>
</ul>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Công việc tiếp theo
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>Vẫn còn khá khá việc để nghịch</p>
<ul>
<li>
<p>Tích hợp dotfiles vào luôn <code>Guix Channel</code> hoặc tạo cái gọi là <code>Guix Profile/Home</code></p>
</li>
<li>
<p>Build cho cả codespace Github</p>
</li>
</ul>
</div>
</div>
</div>
</div>

  
  </div>
</article>


    <footer id="footer">
  <div class="footer-left">
    Copyright  &copy; 2023  MẤY KHI MẤY KHỈ 
  </div>
  <div class="footer-right">
    <nav>
      <ul>
         
        <li><a href="/post/intro">Intro</a></li>
         
        <li><a href="/post">Writings</a></li>
        
      </ul>
    </nav>
  </div>
</footer>


  </div>
</body>

<link rel="stylesheet" href=/lib/font-awesome/css/all.min.css>
<script src=/lib/jquery/jquery.min.js></script>
<script src=/js/main.js></script>
</html>
